RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/pds_reg.h
    /* 0x4 : PDS_TIME1 */
    union {
        struct
        {
            uint32_t cr_sleep_duration : 32; /* [31: 0],        r/w,      0xca8 */
        } BF;
        uint32_t WORD;
    } PDS_TIME1;

    /* 0x8  reserved */
    uint8_t RESERVED0x8[4];

    /* 0xC : PDS_INT */
    union {
        struct
        {
            uint32_t ro_pds_wake_int          : 1; /* [    0],          r,        0x0 */
            uint32_t reserved_1               : 1; /* [    1],       rsvd,        0x0 */
            uint32_t ro_pds_rf_done_int       : 1; /* [    2],          r,        0x0 */
            uint32_t ro_pds_pll_done_int      : 1; /* [    3],          r,        0x0 */
            uint32_t pds_reset_event          : 3; /* [ 6: 4],          r,        0x0 */
            uint32_t pds_clr_reset_event      : 1; /* [    7],          w,        0x0 */
            uint32_t cr_pds_wake_int_mask     : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9               : 1; /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_rf_done_int_mask  : 1; /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_pll_done_int_mask : 1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_14           : 3; /* [14:12],       rsvd,        0x0 */
            uint32_t cr_pds_int_clr           : 1; /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_wakeup_src_en     : 8; /* [23:16],        r/w,       0xff */
            uint32_t ro_pds_wakeup_event      : 8; /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_INT;

    /* 0x10 : PDS_CTL2 */
    union {
        struct
        {
            uint32_t cr_pds_force_np_pwr_off   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1                : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_pwr_off   : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_pwr_off  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_pds_force_np_iso_en    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5                : 1;  /* [    5],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_iso_en    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_iso_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_force_np_pds_rst   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9                : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_pds_rst   : 1;  /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_pds_rst  : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_pds_force_np_mem_stby  : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13               : 1;  /* [   13],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_mem_stby  : 1;  /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_mem_stby : 1;  /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_force_np_gate_clk  : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17               : 1;  /* [   17],       rsvd,        0x0 */
            uint32_t cr_pds_force_bz_gate_clk  : 1;  /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_gate_clk : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reserved_20_31            : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL2;

    /* 0x14 : PDS_CTL3 */
    union {
        struct
        {
            uint32_t reserved_0                 : 1; /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pwr_off  : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_pds_force_ble_pwr_off   : 1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_4               : 2; /* [ 4: 3],       rsvd,        0x0 */
            uint32_t cr_pds_force_ble_iso_en    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6                 : 1; /* [    6],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pds_rst  : 1; /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_force_ble_pds_rst   : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9                 : 1; /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_mem_stby : 1; /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_force_ble_mem_stby  : 1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12                : 1; /* [   12],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_gate_clk : 1; /* [   13],        r/w,        0x0 */
            uint32_t cr_pds_force_ble_gate_clk  : 1; /* [   14],        r/w,        0x0 */
            uint32_t reserved_15_23             : 9; /* [23:15],       rsvd,        0x0 */
            uint32_t cr_pds_np_iso_en           : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_26             : 2; /* [26:25],       rsvd,        0x0 */
            uint32_t cr_pds_bz_iso_en           : 1; /* [   27],        r/w,        0x1 */
            uint32_t cr_pds_ble_iso_en          : 1; /* [   28],        r/w,        0x1 */
            uint32_t cr_pds_usb_iso_en          : 1; /* [   29],        r/w,        0x1 */
            uint32_t cr_pds_misc_iso_en         : 1; /* [   30],        r/w,        0x1 */
            uint32_t reserved_31                : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL3;

    /* 0x18 : PDS_CTL4 */
    union {
        struct
        {
            uint32_t cr_pds_np_pwr_off       : 1; /* [    0],        r/w,        0x1 */
            uint32_t cr_pds_np_reset         : 1; /* [    1],        r/w,        0x1 */
            uint32_t cr_pds_np_mem_stby      : 1; /* [    2],        r/w,        0x1 */
            uint32_t cr_pds_np_gate_clk      : 1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_11           : 8; /* [11: 4],       rsvd,        0x0 */
            uint32_t cr_pds_bz_pwr_off       : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_pds_bz_reset         : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_bz_mem_stby      : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_bz_gate_clk      : 1; /* [   15],        r/w,        0x1 */
            uint32_t cr_pds_ble_pwr_off      : 1; /* [   16],        r/w,        0x1 */
            uint32_t cr_pds_ble_reset        : 1; /* [   17],        r/w,        0x1 */
            uint32_t cr_pds_ble_mem_stby     : 1; /* [   18],        r/w,        0x1 */
            uint32_t cr_pds_ble_gate_clk     : 1; /* [   19],        r/w,        0x1 */
            uint32_t cr_pds_usb_pwr_off      : 1; /* [   20],        r/w,        0x1 */
            uint32_t cr_pds_usb_reset        : 1; /* [   21],        r/w,        0x1 */
            uint32_t cr_pds_usb_mem_stby     : 1; /* [   22],        r/w,        0x1 */
            uint32_t cr_pds_usb_gate_clk     : 1; /* [   23],        r/w,        0x1 */
            uint32_t cr_pds_misc_pwr_off     : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_pds_misc_reset       : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_pds_misc_mem_stby    : 1; /* [   26],        r/w,        0x1 */
            uint32_t cr_pds_misc_gate_clk    : 1; /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_29          : 2; /* [29:28],       rsvd,        0x0 */
            uint32_t cr_pds_misc_ana_pwr_off : 1; /* [   30],        r/w,        0x1 */
            uint32_t cr_pds_misc_dig_pwr_off : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } PDS_CTL4;

    /* 0x1C : pds_stat */
    union {
        struct
        {
            uint32_t ro_pds_state     : 4;  /* [ 3: 0],          r,        0x0 */
            uint32_t reserved_4_7     : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t ro_pds_rf_state  : 4;  /* [11: 8],          r,        0x0 */
            uint32_t reserved_12_15   : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t ro_pds_pll_state : 2;  /* [17:16],          r,        0x0 */
            uint32_t reserved_18_31   : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_stat;

    /* 0x20 : pds_ram1 */
    union {
        struct
        {
            uint32_t cr_pds_ram_ret1n : 4;  /* [ 3: 0],        r/w,        0xf */
            uint32_t cr_pds_ram_ret2n : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t cr_pds_ram_pgen  : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_31   : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_ram1;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[12];

    /* 0x30 : pds_gpio_set_pu_pd */
    union {
        struct
        {
            uint32_t cr_pds_gpio_22_17_pd : 6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t cr_pds_gpio_22_17_pu : 6; /* [13: 8],        r/w,        0x0 */
            uint32_t reserved_14_15       : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_pds_gpio_28_23_pd : 6; /* [21:16],        r/w,        0x0 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t cr_pds_gpio_28_23_pu : 6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31       : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_gpio_set_pu_pd;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[12];

