RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/pds_reg.h
    /* 0x40 : pds_gpio_int */
    union {
        struct
        {
            uint32_t pds_gpio_int_mask   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t pds_gpio_int_stat   : 1;  /* [    1],          r,        0x0 */
            uint32_t pds_gpio_int_clr    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3          : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t pds_gpio_int_mode   : 3;  /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7          : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t pds_gpio_int_select : 3;  /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11_31      : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_gpio_int;

    /* 0x44  reserved */
    uint8_t RESERVED0x44[700];

    /* 0x300 : rc32m_ctrl0 */
    union {
        struct
        {
            uint32_t rc32m_cal_done        : 1; /* [    0],          r,        0x0 */
            uint32_t rc32m_rdy             : 1; /* [    1],          r,        0x0 */
            uint32_t rc32m_cal_inprogress  : 1; /* [    2],          r,        0x0 */
            uint32_t rc32m_cal_div         : 2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32m_cal_precharge   : 1; /* [    5],          r,        0x0 */
            uint32_t rc32m_dig_code_fr_cal : 8; /* [13: 6],          r,        0x0 */
            uint32_t reserved_14_16        : 3; /* [16:14],       rsvd,        0x0 */
            uint32_t rc32m_allow_cal       : 1; /* [   17],        r/w,        0x0 */
            uint32_t rc32m_refclk_half     : 1; /* [   18],        r/w,        0x0 */
            uint32_t rc32m_ext_code_en     : 1; /* [   19],        r/w,        0x1 */
            uint32_t rc32m_cal_en          : 1; /* [   20],        r/w,        0x0 */
            uint32_t rc32m_pd              : 1; /* [   21],        r/w,        0x0 */
            uint32_t rc32m_code_fr_ext     : 8; /* [29:22],        r/w,       0x60 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl0;

    /* 0x304 : rc32m_ctrl1 */
    union {
        struct
        {
            uint32_t rc32m_test_en      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t rc32m_soft_rst     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rc32m_clk_soft_rst : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rc32m_clk_inv      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rc32m_clk_force_on : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_23      : 19; /* [23: 5],       rsvd,        0x0 */
            uint32_t rc32m_reserved     : 8;  /* [31:24],        r/w,        0xf */
        } BF;
        uint32_t WORD;
    } rc32m_ctrl1;

    /* 0x308  reserved */
    uint8_t RESERVED0x308[248];

    /* 0x400 : pu_rst_clkpll */
    union {
        struct
        {
            uint32_t clkpll_sdm_reset     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t clkpll_reset_postdiv : 1;  /* [    1],        r/w,        0x0 */
            uint32_t clkpll_reset_fbdv    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t clkpll_reset_refdiv  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t clkpll_pu_postdiv    : 1;  /* [    4],        r/w,        0x1 */
            uint32_t clkpll_pu_fbdv       : 1;  /* [    5],        r/w,        0x1 */
            uint32_t clkpll_pu_clamp_op   : 1;  /* [    6],        r/w,        0x1 */
            uint32_t clkpll_pu_pfd        : 1;  /* [    7],        r/w,        0x1 */
            uint32_t clkpll_pu_cp         : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_clkpll_sfreg      : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_clkpll            : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pu_rst_clkpll;

    /* 0x404 : clkpll_top_ctrl */
    union {
        struct
        {
            uint32_t clkpll_postdiv        : 7; /* [ 6: 0],        r/w,       0x14 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t clkpll_refdiv_ratio   : 4; /* [11: 8],        r/w,        0x4 */
            uint32_t clkpll_xtal_rc32m_sel : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15        : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t clkpll_refclk_sel     : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19        : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t clkpll_vg11_sel       : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23        : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t clkpll_resv           : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31        : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_top_ctrl;

    /* 0x408 : clkpll_cp */
    union {
        struct
        {
            uint32_t clkpll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t clkpll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t clkpll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x1 */
            uint32_t clkpll_int_frac_sw   : 1;  /* [    8],        r/w,        0x1 */
            uint32_t clkpll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t clkpll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31       : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_cp;

    /* 0x40C : clkpll_rz */
    union {
        struct
        {
            uint32_t clkpll_c4_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3    : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t clkpll_r4       : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7    : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t clkpll_r4_short : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11   : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t clkpll_c3       : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t clkpll_cz       : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t clkpll_rz       : 3;  /* [18:16],        r/w,        0x5 */
            uint32_t reserved_19_31  : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_rz;

