RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/pds_reg.h
    /* 0x410 : clkpll_fbdv */
    union {
        struct
        {
            uint32_t clkpll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t clkpll_sel_fb_clk     : 2;  /* [ 3: 2],        r/w,        0x1 */
            uint32_t reserved_4_31         : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_fbdv;

    /* 0x414 : clkpll_vco */
    union {
        struct
        {
            uint32_t clkpll_vco_speed : 3;  /* [ 2: 0],        r/w,        0x6 */
            uint32_t clkpll_shrtr     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31    : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_vco;

    /* 0x418 : clkpll_sdm */
    union {
        struct
        {
            uint32_t clkpll_sdmin      : 24; /* [23: 0],        r/w,   0x600000 */
            uint32_t clkpll_dither_sel : 2;  /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_27    : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t clkpll_sdm_flag   : 1;  /* [   28],        r/w,        0x1 */
            uint32_t clkpll_sdm_bypass : 1;  /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31    : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_sdm;

    /* 0x41C : clkpll_output_en */
    union {
        struct
        {
            uint32_t clkpll_en_480m      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t clkpll_en_240m      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t clkpll_en_192m      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t clkpll_en_160m      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t clkpll_en_120m      : 1;  /* [    4],        r/w,        0x0 */
            uint32_t clkpll_en_96m       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t clkpll_en_80m       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t clkpll_en_48m       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t clkpll_en_32m       : 1;  /* [    8],        r/w,        0x1 */
            uint32_t clkpll_en_div2_480m : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31      : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_output_en;

    /* 0x420 : clkpll_test_enable */
    union {
        struct
        {
            uint32_t dten_clkpll_postdiv_clk : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dten_clk96M             : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dten_clk32M             : 1;  /* [    2],        r/w,        0x0 */
            uint32_t dten_clkpll_fsdm        : 1;  /* [    3],        r/w,        0x0 */
            uint32_t dten_clkpll_fref        : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_clkpll_fin         : 1;  /* [    5],        r/w,        0x0 */
            uint32_t ten_clkpll_sfreg        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t ten_clkpll              : 1;  /* [    7],        r/w,        0x0 */
            uint32_t clkpll_dc_tp_out_en     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31           : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clkpll_test_enable;
};

typedef volatile struct pds_reg pds_reg_t;

#endif /* __PDS_REG_H__ */
